multiRegionTwoPhaseStratifiedShearFlow/constant/fluidB/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
    (0 0.0 0)
    (10.0 0.0 0)
    (10.0 10.0 0)
    (0 10.0 0)
    (0 0.0 0.00001)
    (10.0 0.0 0.00001)
    (10.0 10.0 0.00001)
    (0 10.0 0.00001)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (50 25 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall left 
    (
        (0 4 7 3)
    )
    wall right
    (
        (2 6 5 1)
    )
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
    wall interfaceShadow
    (
        (3 7 6 2)
    )
    wall bottom
    (
        (1 5 4 0)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
