multiRegionTwoPhaseStratifiedShearFlow/constant/multiRegionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      coupledSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(
    navierStokesFluid (fluidA)
    navierStokesFluid (fluidB) 
);

partitionedTypeRegionInterfaces
(
    fluidAfluidB 
    (
        (((fluidA bottom)(fluidB top)) (U))
    )
);

monolithicTypeRegionInterfaces
();

// Assembles a super-mesh
superMeshRegions
();

partitionedCoupling
{
    maxCoupleIter 6;
}

// ************************************************************************* //
