multiRegionTwoPhaseStratifiedShearFlow/0/fluidA/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1e-06 0);

boundaryField
{
"proc.*"
{
	type	processor;
	value	uniform (0 0 0);
}
// no-slip at the walls parallel to the interface
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
// zero-gradient for inlet/outlet
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
// interfacial BC       
    interface
    {
        type                    interfaceCoupledVelocityFlux;
        secondOrder             yes;
        nonOrthCorr             yes;
        neighbourRegionName     fluidB;
        neighbourPatchName      interfaceShadow;
        neighbourFieldName      U;
        k                       "muFluidA";
        value                   uniform (0 0 0);
    }
    frontAndBack
    {
        type                    empty;
    }
}


// ************************************************************************* //
