multiRegionTwoPhaseStratifiedShearFlow/0/fluidA/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
"proc.*"
{
	type	processor;
	value	uniform 0;
}
// fixed values for the inlet (p(x=0)) and outlet (p(x=L))
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            fixedValue;
        value           uniform 0.0021;
    } 
// zero gradient for the walls parallel to the interface  
    top
    {
        type            zeroGradient;
    }
// interfacial BC    
    interface
    {
        type                    interfaceCoupledPressureValue;
        secondOrder             yes;
        nonOrthCorr             yes;
        neighbourRegionName     fluidB;
        neighbourPatchName      interfaceShadow;
        neighbourFieldName      p;
        k                       "rhoFluidA"; 
        value                   uniform 0;
    }
    frontAndBack
    {
        type                    empty;
    }
}


// ************************************************************************* //
